; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	spectrograph3 - mode
	image2 - mode
	infrared1 - mode
	image0 - mode
	GroundStation4 - direction
	Star1 - direction
	GroundStation3 - direction
	Star0 - direction
	GroundStation2 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image2)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 image2)
	(supports instrument3 infrared1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 infrared1)
	(supports instrument4 image2)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared1)
	(supports instrument5 image0)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star0)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
)
(:goal (and
	(have_image Planet5 infrared1)
	(have_image Phenomenon6 spectrograph3)
	(have_image Star7 infrared1)
	(have_image Phenomenon8 image0)
	(have_image Star9 image2)
))

)

; plan
1. (turn_to satellite1 groundstation2 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 5
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 5
3. (calibrate satellite1 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 0 of 5
4. (turn_to satellite1 planet5 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet5)
   goals met: 0 of 5
5. (take_image satellite1 planet5 instrument4 infrared1)
   added: (have_image planet5 infrared1)
   goals met: 1 of 5
6. (turn_to satellite1 phenomenon6 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 5
7. (take_image satellite1 phenomenon6 instrument4 spectrograph3)
   added: (have_image phenomenon6 spectrograph3)
   goals met: 2 of 5
8. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 5
9. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 2 of 5
10. (turn_to satellite0 phenomenon8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 5
11. (take_image satellite0 phenomenon8 instrument1 image0)
   added: (have_image phenomenon8 image0)
   goals met: 3 of 5
12. (turn_to satellite0 star9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star9)
   goals met: 3 of 5
13. (take_image satellite0 star9 instrument1 image2)
   added: (have_image star9 image2)
   goals met: 4 of 5
14. (turn_to satellite1 star7 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star7)
   goals met: 4 of 5
15. (take_image satellite1 star7 instrument4 infrared1)
   added: (have_image star7 infrared1)
   goals met: 5 of 5
